[{"name":"Petteri","diaryItemList":[{"date":"2019-01-07","subject":"D-Day","diaryText":"This is it when it all begins... Tänään opittiin olemaan campuksella ja vähän siitä mikä on tulevien viikkojen tahti.","textID":1548998646185},{"date":"2019-01-11","subject":"Eka viikko","diaryText":"Tällä viikolla on opittu paljon Javascriptistä ja jotain on jopa ihan sisäistettykin ja osataan käyttää koodatessa.\nHurja tahti koko viikon mutta edelleen ollaan junan kyydissä.","textID":1548998734578},{"date":"2019-01-18","subject":"Toinen viikko","diaryText":"Toinen viikko tiivistä tahtia takana ja tällä viikolla opittiin NodeJS:llä koodaamista eli backendiä. \nPerjantaina onnistuttin hienosti testissä, kaikki onnistuivat. Saa nähdä mitä ensi viikon Checkpoin tuo tullessaan...","textID":1548998843543},{"date":"2019-01-25","subject":"Kolmas viikko","diaryText":"Tällä viikolla oli ensimmäinen ryhmä/parityöskentely. Se opetti yhdessä koodaamisen mallia ja kuinka sitä voisi tai pitäisi tehdä. Harjoitusta lisää ja tullaan siinäkin mestareiksi.\nTämän viikon checkpoint palautti syvän nöyryyden ja ymmärryksen siitä, että eihän me osata vielä yhtään mitään. Harjoitusta lisää ja ehkä jonain päivänä osataan jotain. ;)","textID":1548998975041},{"date":"2019-02-01","subject":"Yksi kolmasosa takana","diaryText":"Ja kaksi kolmasosaa vielä edessäpäin. Ensi viikolla tahti taas kiristyy, kun palataan normi opetukseen.\nTällä viikolla harjoiteltiin lisää tiimissä tekemistä, kun koodattiin miniprojekteja.\nKaikki onnistuivat hienosti ja lopputulokset näyttävät mahtavilta.\nSamalla oppi paljon itsestä ja siitä mitkä ovat vahvuudet ja heikkoudet tiimityöskentelyssä. Erityisesti ne omat heikkoudet... ;D","textID":1548999245890},{"date":"2018-12-10","subject":"Ennakko-opiskelun aloitus","diaryText":"Tänään saatiin vähän esimakua tulevasta ja tavattiin kaikki uudet mahtavat kanssaopiskelijat. Iso ryhmä ja todella erilaisia taustoja mutta kaikilla kova halu oppia koodaamaan.","textID":1548999328501},{"date":"2019-01-24","subject":"Git Day","diaryText":"Tänään ohjelmassa oli Gitin pikakurssi ja vaikutti selkeältä. Ei vaikea =)\n\nMutta totuus oli toisenlainen...Kun päästiin oikeasti käyttämään, niin eihän se ihan niin helpolla mennyt mutta harjoitus teki aloittelevan mestarin siinäkin.","textID":1549000237912}]}]